# AddInId Properties

---
The AddInId type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
AddInId Class
Autodesk.Revit.DB Namespace